<a href="https://colab.research.google.com/github/ptsnbkht/DI-Bootcamp/blob/main/daily_challenge_d3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:

import pandas as pd
from sklearn.preprocessing import MinMaxScaler
df = pd.read_csv('datascience_salaries.csv')
scaler = MinMaxScaler()
df['salary_normalized'] = scaler.fit_transform(df[['salary']])
print(df[['salary', 'salary_normalized']].head())

   salary  salary_normalized
0  149000           0.601010
1  120000           0.454545
2   68000           0.191919
3  120000           0.454545
4  149000           0.601010

In [5]:

experience_level_grouped = df.groupby('experience_level')

average_salary_by_experience = experience_level_grouped['salary'].mean()
median_salary_by_experience = experience_level_grouped['salary'].median()

print("Average Salary by Experience Level:")
print(average_salary_by_experience)

print("\nMedian Salary by Experience Level:")
median_salary_by_experience

Average Salary by Experience Level:
experience_level
Entry        36111.111111
Executive    76076.923077
Mid          51786.885246
Senior       75088.033012
Name: salary, dtype: float64

Median Salary by Experience Level:

experience_level
Entry        30000.0
Executive    46000.0
Mid          51000.0
Senior       68000.0
Name: salary, dtype: float64